{
  "schema_version": "1.0.0",
  "testlets": [
    {
      "ap_type": "storm",
      "label": "Storm Slab Avalanche Problems",
      "items": [
        {
          "id": "storm_development_01",
          "construct": "development",
          "stem": "Storm slab avalanche problems typically develop when:",
          "choices": [
            { "value": "A", "text": "New snow accumulates rapidly during or shortly after a storm" },
            { "value": "B", "text": "Old snow layers warm up over several days" },
            { "value": "C", "text": "Wind redistributes existing snow without new precipitation" },
            { "value": "D", "text": "Temperature gradients create depth hoar formation" }
          ],
          "key": "A",
          "explain": "Storm slabs form when new snow accumulates rapidly (typically >2-3 cm/hr or >20-30cm in 24hrs) during or immediately after storms, before the new snow has time to bond properly with the old snow surface."
        },
        {
          "id": "storm_behaviour_01",
          "construct": "behaviour",
          "stem": "Storm slab avalanches are most likely to occur:",
          "choices": [
            { "value": "A", "text": "Several days after a storm has ended" },
            { "value": "B", "text": "During and within 48 hours of new snowfall" },
            { "value": "C", "text": "Only on very steep slopes greater than 45 degrees" },
            { "value": "D", "text": "Primarily in spring conditions with warming temperatures" }
          ],
          "key": "B",
          "explain": "Storm slabs are most reactive during and immediately after storms, typically becoming more stable within 48 hours as the new snow bonds and settles, though this timeline can vary with weather conditions."
        },
        {
          "id": "storm_assessment_01",
          "construct": "assessment",
          "stem": "When assessing storm slab conditions, the most important factors to consider are:",
          "choices": [
            { "value": "A", "text": "Air temperature and humidity levels only" },
            { "value": "B", "text": "Recent snowfall amounts, wind speed, and slope steepness" },
            { "value": "C", "text": "Snow crystal type and solar radiation" },
            { "value": "D", "text": "Historical avalanche patterns from previous years" }
          ],
          "key": "B",
          "explain": "Storm slab assessment focuses on recent weather: snowfall amount and rate, wind loading, temperature during the storm, and terrain factors like slope steepness and aspect that affect loading and stress."
        },
        {
          "id": "storm_mitigation_01",
          "construct": "mitigation",
          "stem": "The best strategy for managing storm slab risk is to:",
          "choices": [
            { "value": "A", "text": "Wait several days after any snowfall before traveling in avalanche terrain" },
            { "value": "B", "text": "Avoid avalanche terrain during and immediately after significant storms" },
            { "value": "C", "text": "Only travel on slopes steeper than 40 degrees where slabs are less likely" },
            { "value": "D", "text": "Focus exclusively on north-facing slopes which are always safer" }
          ],
          "key": "B",
          "explain": "The most effective storm slab mitigation is avoiding avalanche terrain during active storms and in the immediate aftermath (24-48 hours), when storm slabs are most reactive and unpredictable."
        }
      ]
    },
    {
      "ap_type": "persistent",
      "label": "Persistent Slab Avalanche Problems",
      "items": [
        {
          "id": "persistent_development_01",
          "construct": "development",
          "stem": "Persistent slab problems develop when:",
          "choices": [
            { "value": "A", "text": "Surface hoar or faceted grains form a weak layer that gets buried" },
            { "value": "B", "text": "Rain falls on existing snow creating an ice layer" },
            { "value": "C", "text": "New snow falls very rapidly during intense storms" },
            { "value": "D", "text": "Spring warming causes the entire snowpack to become wet" }
          ],
          "key": "A",
          "explain": "Persistent slabs form when weak layers like surface hoar, near-surface facets, or other persistent grain types are buried by subsequent snow, creating a long-lasting failure plane within the snowpack."
        },
        {
          "id": "persistent_behaviour_01",
          "construct": "behaviour",
          "stem": "Persistent slab avalanches are characterized by:",
          "choices": [
            { "value": "A", "text": "Occurring only during active storms" },
            { "value": "B", "text": "Remaining reactive for weeks or months after burial" },
            { "value": "C", "text": "Only releasing on very specific slope aspects" },
            { "value": "D", "text": "Being impossible to trigger artificially" }
          ],
          "key": "B",
          "explain": "Persistent slabs can remain reactive for extended periods (weeks to months) because the buried weak layer maintains its poor bonding characteristics, making them unpredictable and dangerous long after formation."
        },
        {
          "id": "persistent_assessment_01",
          "construct": "assessment",
          "stem": "The most reliable sign of persistent slab conditions is:",
          "choices": [
            { "value": "A", "text": "Recent avalanche activity on similar slopes and aspects" },
            { "value": "B", "text": "Cold temperatures and clear skies" },
            { "value": "C", "text": "Heavy snowfall in the past 24 hours" },
            { "value": "D", "text": "Strong winds from any direction" }
          ],
          "key": "A",
          "explain": "Recent avalanche activity is the strongest indicator of persistent slab instability, as it shows the weak layer is still active and capable of propagating across terrain."
        },
        {
          "id": "persistent_mitigation_01",
          "construct": "mitigation",
          "stem": "When persistent slab conditions exist, the safest approach is:",
          "choices": [
            { "value": "A", "text": "Travel only in the early morning when temperatures are coldest" },
            { "value": "B", "text": "Avoid all avalanche terrain until the weak layer is no longer reactive" },
            { "value": "C", "text": "Only ski slopes that face away from the wind" },
            { "value": "D", "text": "Use explosive charges to test slope stability before skiing" }
          ],
          "key": "B",
          "explain": "Persistent slabs are notoriously unpredictable and can remain dangerous for extended periods. The safest strategy is complete avoidance of avalanche terrain until the weak layer is demonstrably inactive."
        }
      ]
    }
  ],
  "diagnostics": [
    {
      "id": "diagnostic_experience_01",
      "construct": "experience",
      "stem": "In the past 5 years, how many times have you witnessed or been involved in an avalanche incident?",
      "choices": [
        { "value": "0", "text": "Never" },
        { "value": "1", "text": "Once" },
        { "value": "2-3", "text": "2-3 times" },
        { "value": "4-5", "text": "4-5 times" },
        { "value": "6+", "text": "More than 5 times" }
      ],
      "key": "0",
      "explain": "This diagnostic question helps assess exposure to avalanche events, which can influence risk perception and decision-making patterns."
    },
    {
      "id": "diagnostic_decision_01",
      "construct": "decision_making",
      "stem": "When you encounter unexpected avalanche signs in the field, you typically:",
      "choices": [
        { "value": "A", "text": "Immediately retreat to safer terrain" },
        { "value": "B", "text": "Gather more information before deciding" },
        { "value": "C", "text": "Continue with increased caution" },
        { "value": "D", "text": "Rely on the group's most experienced member to decide" }
      ],
      "key": "A",
      "explain": "Conservative decision-making in response to unexpected instability signs is generally the safest approach, though this diagnostic assesses individual decision-making tendencies."
    },
    {
      "id": "diagnostic_knowledge_01",
      "construct": "knowledge_application",
      "stem": "You observe recent avalanche activity on a north-facing slope at 2400m elevation. The most appropriate response for similar nearby terrain is:",
      "choices": [
        { "value": "A", "text": "Avoid all north-facing slopes at similar elevations" },
        { "value": "B", "text": "Only avoid the specific slope where you saw the avalanche" },
        { "value": "C", "text": "Switch to south-facing slopes which are always safer" },
        { "value": "D", "text": "Continue as planned since avalanches rarely repeat in the same area" }
      ],
      "key": "A",
      "explain": "Recent avalanche activity indicates instability that likely extends to similar terrain (same aspect, elevation, and slope characteristics), making avoidance of similar slopes the most appropriate response."
    }
  ]
}
